HuuThanhBui/github-demo/hardware_test/SPI/evkmimxrt1170_lpspi_polling_b2b_transfer_master_cm4_OSRAM_SPI_m4/board/pin_mux.c
/*
 * Copyright 2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v12.0
processor: MIMXRT1176xxxxx
package_id: MIMXRT1176DVMAA
mcu_data: ksdk2_0
processor_version: 12.0.0
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: L13, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: M15, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: M17, peripheral: LPSPI1, signal: PCS0, pin_signal: GPIO_AD_29, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: L17, peripheral: LPSPI1, signal: SCK, pin_signal: GPIO_AD_28, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: J17, peripheral: LPSPI1, signal: SIN, pin_signal: GPIO_AD_31, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
  - {pin_num: K17, peripheral: LPSPI1, signal: SOUT, pin_signal: GPIO_AD_30, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Slow}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
		IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
	    IOMUXC_GPIO_DISP_B2_12_LPSPI4_SCK,           /* GPIO_AD_28 is configured as LPSPI1_SCK */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */


  IOMUXC_SetPinMux(
	    IOMUXC_GPIO_DISP_B2_14_LPSPI4_SOUT,          /* GPIO_AD_30 is configured as LPSPI1_SOUT */
		0U);                                    /* Software Input On Field: Input Path is determined by functionality */


  IOMUXC_SetPinConfig(
		IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 PAD functional properties : */
		0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												   Drive Strength Field: high drive strength
												   Pull / Keep Select Field: Pull Disable, Highz
												   Pull Up / Down Config. Field: Weak pull down
												   Open Drain Field: Disabled
												   Domain write protection: Both cores are allowed
												   Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
		IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 PAD functional properties : */
		0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												   Drive Strength Field: high drive strength
												   Pull / Keep Select Field: Pull Disable, Highz
												   Pull Up / Down Config. Field: Weak pull down
												   Open Drain Field: Disabled
												   Domain write protection: Both cores are allowed
												   Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
	    IOMUXC_GPIO_DISP_B2_12_LPSPI4_SCK,           /* GPIO_AD_28 PAD functional properties : */
		0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												   Drive Strength Field: high drive strength
												   Pull / Keep Select Field: Pull Disable, Highz
												   Pull Up / Down Config. Field: Weak pull down
												   Open Drain Field: Disabled
												   Domain write protection: Both cores are allowed
												   Domain write protection lock: Neither of DWP bits is locked */

  IOMUXC_SetPinConfig(
	    IOMUXC_GPIO_DISP_B2_14_LPSPI4_SOUT,          /* GPIO_AD_30 PAD functional properties : */
		0x02U);                                 /* Slew Rate Field: Slow Slew Rate
												   Drive Strength Field: high drive strength
												   Pull / Keep Select Field: Pull Disable, Highz
												   Pull Up / Down Config. Field: Weak pull down
												   Open Drain Field: Disabled
												   Domain write protection: Both cores are allowed
												   Domain write protection lock: Neither of DWP bits is locked */
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
